# SimpleConnectionTooFarRefs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralCustomConnectionFailures..::..SimpleConnectionTooFarRefs Property
BuiltInFailures..::..StructuralCustomConnectionFailures Class See Also
---
Simple Structural Connection Handler cannot connect too far elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SimpleConnectionTooFarRefs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SimpleConnectionTooFarRefs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SimpleConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace